[
  {
    "title": "TravelSwarm AI-Powered Travel Planner",
    "description": "A distributed backend system enabling LLM-driven itinerary planning with asynchronous user interactions using Crew AI and Google Vertex AI (Gemini).",
    "highlights": [
      "Designed microservices in Java (Spring Boot) and Python (Flask), integrated via RabbitMQ.",
      "Utilized Google Vertex AI (Gemini) and Crew AI for intelligent, agent-based planning.",
      "Persisted state with PostgreSQL and containerized all services with Docker for portability.",
      "Implemented automated CI/CD pipelines for builds and deployments."
    ],
    "tags": ["Java", "Spring Boot", "Python", "RabbitMQ", "Docker", "Google Vertex AI", "CrewAI"],
    "link": "https://github.com/vatsalgandhi83"
  },
  {
    "title": "SJ Hopes Shelter Coordination Platform",
    "description": "A real-time coordination platform for shelters and support staff, featuring live task workflows and geolocation-based availability updates. Won 2nd Prize at SJ Hacks Hackathon.",
    "highlights": [
      "Engineered a full-stack, microservices-oriented platform using Java (Spring Boot) and MySQL.",
      "Delivered a polished, user-centric product recognized for its impact and scalability.",
      "Developed a responsive frontend with React, Next.js, and TypeScript.",
      "Enhanced observability with application logging and performance metrics."
    ],
    "tags": ["Java", "Spring Boot", "React", "Next.js", "TypeScript", "MySQL", "Google Maps API"],
    "link": "https://github.com/vatsalgandhi83"
  },
  {
    "title": "BookTable Restaurant Booking System",
    "description": "A full-stack, cloud-native restaurant booking system supporting high-concurrency real-time search, reservations, and admin workflows.",
    "highlights": [
      "Developed backend services with Java (Spring Boot) and a NoSQL database (MongoDB).",
      "Deployed with a full CI/CD pipeline and autoscaling on AWS (EC2, ALB, ASG, ECR).",
      "Built a responsive user interface using ReactJS.",
      "Ensured consistent performance under varying workloads through cloud-native design."
    ],
    "tags": ["Java", "Spring Boot", "ReactJS", "MongoDB", "AWS", "Docker", "GitHub Actions"],
    "link": "https://github.com/vatsalgandhi83"
  },
  {
    "title": "Eventure - Event Management Platform",
    "description": "A full-stack web application for event management, built collaboratively as a team project. The application allows users to browse, book, and manage events, while providing a dedicated portal for event managers to create and manage their listings.",
    "highlights": [
      "Developed backend REST APIs with Java (Spring Boot) and a NoSQL database (MongoDB).",
      "Built a responsive user interface using React and Next.js.",
      "Implemented secure user authentication with JSON Web Tokens (JWT).",
      "Integrated the PayPal sandbox API to simulate the payment workflow for ticket booking.",
      "Engineered features for real-time ticket availability tracking, automated email confirmations, and dynamic PDF ticket generation with QR codes."
    ],
    "tags": ["Java", "Spring Boot", "React", "Next.js", "MongoDB", "JWT", "PayPal API", "Apache PDFBox", "ZXing", "Tailwind CSS"],
    "link": "https://github.com/vatsalgandhi83/eventure-ema"
  },
  {
    "title": "Distinguishing Human and AI-Generated Voices Using PCA Analysis",
    "description": "An analytical project to differentiate between human and AI-generated speech by preparing a unique dataset, extracting key audio features, and applying Principal Component Analysis (PCA) for dimensionality reduction.",
    "highlights": [
      "Analyzed human and AI-generated voices by preparing a dataset, extracting audio features, and applying Principal Component Analysis (PCA) for dimensionality reduction.",
      "Utilized MATLAB and Python to visualize the separability of voice features in PCA space, demonstrating applied experience with MATLAB for analytical modeling and debugging."
    ],
    "tags": ["Python", "Google CoLab", "MATLAB", "PCA", "Data Analysis", "Feature Engineering"]
  },
  {
    "title": "Portfolio Website",
    "description": "My personal portfolio website built with Next.js and TypeScript.",
    "highlights": [
      "Built with Next.js 14 and TypeScript for type safety and performance",
      "Responsive design with modern CSS modules architecture",
      "Automated CI/CD pipeline with GitHub Actions",
      "Dynamic content management with JSON data structure",
      "SEO optimized with proper meta tags and structured data"
    ],
    "tags": ["Next.js", "TypeScript", "Tailwind CSS"],
    "link": "https://github.com/vatsalgandhi83/portfolio-vkg"
  }
]
